---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalSurfaces
source: html/5faf1c49-1cb3-6692-2b19-73fa44903766.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalSurfaces Method

The collection of analytical surfaces.

## Syntax (C#)
```csharp
public IList<EnergyAnalysisSurface> GetAnalyticalSurfaces()
```

## Returns
Returns the analytical surfaces after model calculation.